{
    "feature": [
        {
            "accent": "#fff67d",
            "label": "CORE SYSTEM MODULE",
            "title": "Technical Gameplay Features",
            "description": "Block Burst is built on a lightweight, modular gameplay architecture optimized for mobile performance, fast iteration, and extensibility.",
            "features": [
                {
                    "title": "Grid & Board System",
                    "description": "A deterministic grid-based system responsible for placement logic, validation, and state tracking.",
                    "items": [
                        {
                            "title": "8x8 Grid Architecture",
                            "description": "Grid represented as a data-driven 2D array; Each cell stores occupancy state and block metadata."
                        },
                        {
                            "title": "Fast Placement Validation",
                            "description": "Bounds and collision checks executed only on affected cells; No physics-based logic."
                        },
                        {
                            "title": "Partial Grid Scanning",
                            "description": "Row and column scans limited to impacted areas after placement for better performance."
                        },
                        {
                            "title": "Grid State Isolation",
                            "description": "Grid logic separated from rendering and input for easier testing and simulation."
                        }
                    ]
                },
                {
                    "title": "Block Shape System",
                    "description": "A flexible block definition system designed for easy expansion and controlled randomness.",
                    "items": [
                        {
                            "title": "Shape Matrix Definitions",
                            "description": "Block shapes stored as Vector2 sets with original position is (0, 0)."
                        },
                        {
                            "title": "Scriptable Shape Data",
                            "description": "Block shapes defined via ScriptableObjects for tuning and reuse."
                        },
                        {
                            "title": "Weighted Random Generator",
                            "description": "Prevents impossible board states by controlling shape frequency and complexity."
                        },
                        {
                            "title": "Ghost Preview Support",
                            "description": "Real-time placement preview aligned to grid cells during drag interaction."
                        }
                    ]
                },
                {
                    "title": "Turn & Game State Logic",
                    "description": "Stateless-friendly turn handling and deterministic game flow.",
                    "items": [
                        {
                            "title": "Turn-Based Block Spawning",
                            "description": "Each turn generates exactly three blocks; not randomly but based on free spaces on board."
                        },
                        {
                            "title": "Game Over Detection",
                            "description": "Evaluates all remaining block shapes against grid state only when required."
                        },
                        {
                            "title": "Instant Restart Support",
                            "description": "No scene reload required; Grid and state reset via data reinitialization."
                        }
                    ]
                },
                {
                    "title": "Line Clear & Scoring System",
                    "description": "Event-driven logic for clearing rows, columns, and calculating scores.",
                    "items": [
                        {
                            "title": "Row & Column Detection",
                            "description": "Simultaneous multi-line detection supported in a single placement."
                        },
                        {
                            "title": "Two-Phase Clear Pipeline",
                            "description": "Mark → animate → clear → VFX to keep visuals and data in sync."
                        },
                        {
                            "title": "Modular Score Calculation",
                            "description": "Base score, multi-line bonus, and combo logic handled via a scoring pipeline."
                        },
                        {
                            "title": "Event-Based Score Updates",
                            "description": "UI, audio, and effects subscribe to score events instead of direct calls."
                        }
                    ]
                },
                {
                    "title": "Input & Interaction Layer",
                    "description": "Unified input handling for touch and mouse with responsive feedback.",
                    "items": [
                        {
                            "title": "Unified Drag System",
                            "description": "Single input layer supporting both mouse and touch interactions."
                        },
                        {
                            "title": "Soft Snap Placement",
                            "description": "Forgiving snap-to-grid behavior for better mobile feel."
                        },
                        {
                            "title": "Invalid Placement Feedback",
                            "description": "Immediate visual and animation response when placement fails."
                        }
                    ]
                },
                {
                    "title": "Visual & Theme System",
                    "description": "Data-driven visual setup decoupled from gameplay logic.",
                    "items": [
                        {
                            "title": "Theme Configuration",
                            "description": "Colors, block styles, and grid visuals defined via theme data."
                        },
                        {
                            "title": "Runtime Theme Switching",
                            "description": "Themes can be swapped without affecting gameplay state."
                        },
                        {
                            "title": "Animation Hooks",
                            "description": "Placement and clear animations triggered through gameplay events."
                        }
                    ]
                },
                {
                    "title": "Performance & Optimization",
                    "description": "Designed for smooth gameplay on low-end mobile devices.",
                    "items": [
                        {
                            "title": "Allocation-Free Core Loop",
                            "description": "No runtime blinding memory allocations during active gameplay."
                        },
                        {
                            "title": "Logic-Only Gameplay Core",
                            "description": "Grid and block logic use pure math and arrays; No physics dependency."
                        }
                    ]
                },
                {
                    "title": "Persistence & Data",
                    "description": "Simple, reliable local data storage with room to scale.",
                    "items": [
                        {
                            "title": "Local Save System",
                            "description": "Stores best score, settings, and theme selection locally."
                        },
                        {
                            "title": "JSON-Friendly Structure",
                            "description": "Save data structured for easy migration or cloud sync later."
                        }
                    ]
                }
            ]
        }
    ]
}
