{
    "overview": {
        "module": "SYSTEM_MODULE_01",
        "title": "Project Overview",
        "description": [
            "Viral Rush is a survival action game where players control a cellular warrior navigating through infected zones to eliminate hostile viruses. The objective is to cleanse each area, gather biological resources, and strengthen the cell to survive increasingly dangerous environments.",
            "The game focuses on fast-paced combat, strategic movement, and progressive expansion. By defeating enemies and collecting resources, players unlock upgrades and new lands, gradually reclaiming the cellular world from viral threats."
        ],
        "metadata": {
            "genre": "Casual, RPG, Survival, Action",
            "platform": "Mobile",
            "editor": "Unity 2022.2 (URP)",
            "dimension": "3D"
        },
        "keywords": [
            "Survival",
            "Resource Collection",
            "Map Expansion",
            "Upgrade System"
        ]
    },

    "design": {
        "module": "SYSTEM_MODULE_02",
        "title": "Project Design",

        "content": [
            {
                "label": "Core Gameplay",
                "type": "content-list",
                "item": [
                    "Player controls a cellular warrior in a hostile environment.",
                    "Viruses spawn and patrol across different regions of the map.",
                    "Defeating viruses drops resources used to upgrade strength.",
                    "Clearing enemies to level up and unlock futher areas."
                ]
            },
            {
                "label": "Combat System",
                "type": "content-list",
                "item": [
                    "Approach the target to attack, and continue attacking until the target's health is depleted. Once you stop attacking, the target will recover very quickly.",
                    "Elite viruses introduce special abilities and hazards.",
                    "Player health management is critical for survival.",
                    "Combat intensity increases as new areas unlock."
                ]
            },
            {
                "label": "Resource & Upgrade System",
                "type": "content-list",
                "item": [
                    "Resources are collected from defeated viruses and map spots.",
                    "Resources are used to upgrade attack, defense, and abilities.",
                    "Upgrades provide permanent progression.",
                    "Some upgrades unlock new mechanics or skills.",
                    "Strategic upgrade choices affect playstyle."
                ]
            },
            {
                "label": "Map Spots",
                "type": "content-list",
                "item": [
                    "Market: Sells ."
                ]
            },
            {
                "label": "Minion Mechanisms",
                "type": "content-list",
                "item": [
                    "Hunter Cell: Helps you defeat small viruses for bonus resources and experiences.",
                    "Transport Cell: Helps you transport resources from character into homebase."
                ]
            },
            {
                "label": "Logic Flow",
                "type": "content-flow",
                "item": [
                    "Cellular warrior spawned in home area",
                    "Explore the map and engage nearby viruses",
                    "Defeat enemies and collect resources",
                    "Upgrade abilities and stats",
                    "Clear the zone and unlock new land",
                    "Repeat with stronger enemies and higher stakes"
                ]
            },
            {
                "label": "World & Progression",
                "type": "content-list",
                "item": [
                    "Map is divided into multiple infection zones.",
                    "Each zone introduces new virus types.",
                    "Environmental hazards increase difficulty.",
                    "Progression is tied to land expansion.",
                    "Late-game areas demand optimized builds."
                ]
            },
            {
                "label": "Visual & Feedback Design",
                "type": "content-list",
                "item": [
                    "Stylized cellular environments with strong color contrast.",
                    "Clear visual distinction between player and virus entities.",
                    "Responsive hit effects and damage feedback.",
                    "Smooth upgrade animations to reinforce progression.",
                    "Dynamic visual changes as areas are purified."
                ]
            }
        ]
    }
}
